Revit 2027 API
RebarUpdateCurvesData.GetChangedCustomHandles Method
 Returns an array containing custom handles that were changed since the last regeneration. Array is empty if no handles were changed since the last regeneration.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<int> GetChangedCustomHandles()
Public Function GetChangedCustomHandles As IList(Of Integer)
public:
IList<int>^ GetChangedCustomHandles()
member GetChangedCustomHandles : unit -> IList<int>
Return Value
IList<Int32>
 Returns an array containing the tags of custom handles that were changed since the last regeneration.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace